import { PrismaClient } from '@prisma/client';
const prisma = new PrismaClient();

async function main() {
  // Очистить таблицу ЛПУ
  await prisma.lpu.deleteMany();

  // Импортировать ВСЕ ЛПУ из списка с правильными кавычками
  const lpus = [
    // ООО «Газпром трансгаз Волгоград»
    { customer: 'ООО «Газпром трансгаз Волгоград»', name: 'Антиповское', latitude: 49.793532, longitude: 45.299924 },
    { customer: 'ООО «Газпром трансгаз Волгоград»', name: 'Бубновское', latitude: 50.995681, longitude: 41.782699 },
    { customer: 'ООО «Газпром трансгаз Волгоград»', name: 'Волгоградское', latitude: 48.609400, longitude: 43.864663 },
    { customer: 'ООО «Газпром трансгаз Волгоград»', name: 'Городищенское', latitude: 48.803026, longitude: 44.369935 },
    { customer: 'ООО «Газпром трансгаз Волгоград»', name: 'Жирновское', latitude: 50.899986, longitude: 44.895829 },
    { customer: 'ООО «Газпром трансгаз Волгоград»', name: 'Калачеевское', latitude: 50.330661, longitude: 41.063403 },
    { customer: 'ООО «Газпром трансгаз Волгоград»', name: 'Калининское', latitude: 49.525328, longitude: 42.046701 },
    { customer: 'ООО «Газпром трансгаз Волгоград»', name: 'Котельниковское', latitude: 47.623723, longitude: 43.229678 },
    { customer: 'ООО «Газпром трансгаз Волгоград»', name: 'Логовское', latitude: 49.464333, longitude: 43.837349 },
    { customer: 'ООО «Газпром трансгаз Волгоград»', name: 'Ольховское', latitude: 49.767477, longitude: 44.615736 },
    { customer: 'ООО «Газпром трансгаз Волгоград»', name: 'Палласовское', latitude: 49.989282, longitude: 46.878472 },
    { customer: 'ООО «Газпром трансгаз Волгоград»', name: 'Писаревское', latitude: 49.917662, longitude: 40.183544 },
    { customer: 'ООО «Газпром трансгаз Волгоград»', name: 'Сохрановское', latitude: 49.518262, longitude: 40.565383 },
    { customer: 'ООО «Газпром трансгаз Волгоград»', name: 'Усть-Бузулукское', latitude: 50.135192, longitude: 42.151395 },
    { customer: 'ООО «Газпром трансгаз Волгоград»', name: 'Фроловское', latitude: 49.644878, longitude: 43.597755 },
    
    // ООО «Газпром трансгаз Екатеринбург»
    { customer: 'ООО «Газпром трансгаз Екатеринбург»', name: 'Алексеевское', latitude: 51.685409, longitude: 53.086323 },
    { customer: 'ООО «Газпром трансгаз Екатеринбург»', name: 'Бузулукское', latitude: 52.779005, longitude: 52.221368 },
    { customer: 'ООО «Газпром трансгаз Екатеринбург»', name: 'Далматовское', latitude: 55.857185, longitude: 62.756153 },
    { customer: 'ООО «Газпром трансгаз Екатеринбург»', name: 'Домбаровское', latitude: 50.873111, longitude: 59.310801 },
    { customer: 'ООО «Газпром трансгаз Екатеринбург»', name: 'Карталинское', latitude: 53.017767, longitude: 60.752041 },
    { customer: 'ООО «Газпром трансгаз Екатеринбург»', name: 'Красногорское', latitude: 54.598097, longitude: 61.176746 },
    { customer: 'ООО «Газпром трансгаз Екатеринбург»', name: 'Магнитогорское', latitude: 53.390340, longitude: 58.885556 },
    { customer: 'ООО «Газпром трансгаз Екатеринбург»', name: 'Малоистокское', latitude: 56.802664, longitude: 60.783118 },
    { customer: 'ООО «Газпром трансгаз Екатеринбург»', name: 'Медногорское', latitude: 51.393816, longitude: 57.792636 },
    { customer: 'ООО «Газпром трансгаз Екатеринбург»', name: 'Невьянское', latitude: 57.436230, longitude: 60.137002 },
    { customer: 'ООО «Газпром трансгаз Екатеринбург»', name: 'Оренбургское', latitude: 51.864024, longitude: 54.709298 },
    { customer: 'ООО «Газпром трансгаз Екатеринбург»', name: 'Челябинское', latitude: 55.369525, longitude: 61.288878 },
    { customer: 'ООО «Газпром трансгаз Екатеринбург»', name: 'Шадринское', latitude: 56.097035, longitude: 63.721064 },
    
    // ООО «Газпром трансгаз Казань»
    { customer: 'ООО «Газпром трансгаз Казань»', name: 'Абдулинское', latitude: 53.658932, longitude: 53.644536 },
    { customer: 'ООО «Газпром трансгаз Казань»', name: 'Альметьевское', latitude: 54.176172, longitude: 52.641478 },
    { customer: 'ООО «Газпром трансгаз Казань»', name: 'Константиновское', latitude: 55.802467, longitude: 49.272027 },
    { customer: 'ООО «Газпром трансгаз Казань»', name: 'Шеморданское', latitude: 56.149665, longitude: 50.376151 },
    
    // ООО «Газпром трансгаз Москва»
    { customer: 'ООО «Газпром трансгаз Москва»', name: 'Белгородское', latitude: 50.616386, longitude: 36.547494 },
    { customer: 'ООО «Газпром трансгаз Москва»', name: 'Белоусовское', latitude: 55.100709, longitude: 36.687935 },
    { customer: 'ООО «Газпром трансгаз Москва»', name: 'Брянское', latitude: 53.296063, longitude: 34.095214 },
    { customer: 'ООО «Газпром трансгаз Москва»', name: 'Воронежское', latitude: 51.687039, longitude: 38.982966 },
    { customer: 'ООО «Газпром трансгаз Москва»', name: 'Гавриловское', latitude: 54.842626, longitude: 39.236604 },
    { customer: 'ООО «Газпром трансгаз Москва»', name: 'Донское', latitude: 52.791059, longitude: 38.804348 },
    { customer: 'ООО «Газпром трансгаз Москва»', name: 'Елецкое', latitude: 52.595898, longitude: 38.407542 },
    { customer: 'ООО «Газпром трансгаз Москва»', name: 'Истьинское', latitude: 54.289322, longitude: 40.158665 },
    { customer: 'ООО «Газпром трансгаз Москва»', name: 'Крюковское', latitude: 56.027378, longitude: 37.178146 },
    { customer: 'ООО «Газпром трансгаз Москва»', name: 'Курское', latitude: 51.493067, longitude: 36.081247 },
    { customer: 'ООО «Газпром трансгаз Москва»', name: 'Моршанское', latitude: 53.651338, longitude: 41.759880 },
    { customer: 'ООО «Газпром трансгаз Москва»', name: 'Московское', latitude: 55.581948, longitude: 37.471555 },
    { customer: 'ООО «Газпром трансгаз Москва»', name: 'Орловское', latitude: 52.947591, longitude: 36.111602 },
    { customer: 'ООО «Газпром трансгаз Москва»', name: 'Острогожское', latitude: 50.837290, longitude: 39.009257 },
    { customer: 'ООО «Газпром трансгаз Москва»', name: 'Путятинское', latitude: 54.082377, longitude: 41.114423 },
    { customer: 'ООО «Газпром трансгаз Москва»', name: 'Серпуховское', latitude: 54.932857, longitude: 37.513712 },
    { customer: 'ООО «Газпром трансгаз Москва»', name: 'Тульское', latitude: 54.037375, longitude: 37.522187 },
    
    // ООО «Газпром трансгаз Нижний Новгород»
    { customer: 'ООО «Газпром трансгаз Нижний Новгород»', name: 'Арзамасское', latitude: 55.440709, longitude: 43.932210 },
    { customer: 'ООО «Газпром трансгаз Нижний Новгород»', name: 'Владимирское', latitude: 56.171256, longitude: 40.494467 },
    { customer: 'ООО «Газпром трансгаз Нижний Новгород»', name: 'Волжское', latitude: 55.989666, longitude: 48.599926 },
    { customer: 'ООО «Газпром трансгаз Нижний Новгород»', name: 'Вятское', latitude: 56.664729, longitude: 50.500391 },
    { customer: 'ООО «Газпром трансгаз Нижний Новгород»', name: 'Заволжское', latitude: 55.748250, longitude: 47.151349 },
    { customer: 'ООО «Газпром трансгаз Нижний Новгород»', name: 'Ивановское', latitude: 56.904097, longitude: 40.851916 },
    { customer: 'ООО «Газпром трансгаз Нижний Новгород»', name: 'Кировское', latitude: 58.536340, longitude: 49.585395 },
    { customer: 'ООО «Газпром трансгаз Нижний Новгород»', name: 'Моркинское', latitude: 56.427502, longitude: 49.055484 },
    { customer: 'ООО «Газпром трансгаз Нижний Новгород»', name: 'Пензенское', latitude: 53.237966, longitude: 44.911128 },
    { customer: 'ООО «Газпром трансгаз Нижний Новгород»', name: 'Пильнинское', latitude: 55.610146, longitude: 45.827564 },
    { customer: 'ООО «Газпром трансгаз Нижний Новгород»', name: 'Починковское', latitude: 54.670725, longitude: 44.650474 },
    { customer: 'ООО «Газпром трансгаз Нижний Новгород»', name: 'Приокское', latitude: 56.240794, longitude: 43.983414 },
    { customer: 'ООО «Газпром трансгаз Нижний Новгород»', name: 'Семеновское', latitude: 56.799966, longitude: 44.499716 },
    { customer: 'ООО «Газпром трансгаз Нижний Новгород»', name: 'Сеченовское', latitude: 55.238214, longitude: 45.957860 },
    { customer: 'ООО «Газпром трансгаз Нижний Новгород»', name: 'Торбеевское', latitude: 54.139037, longitude: 43.264214 },
    { customer: 'ООО «Газпром трансгаз Нижний Новгород»', name: 'Чебоксарское', latitude: 56.095527, longitude: 47.264312 },
    
    // ООО «Газпром трансгаз Самара»
    { customer: 'ООО «Газпром трансгаз Самара»', name: 'Отрадненское', latitude: 53.352046, longitude: 51.313009 },
    { customer: 'ООО «Газпром трансгаз Самара»', name: 'Павловское', latitude: 52.678640, longitude: 46.989458 },
    { customer: 'ООО «Газпром трансгаз Самара»', name: 'Северное', latitude: 54.175892, longitude: 52.643861 },
    { customer: 'ООО «Газпром трансгаз Самара»', name: 'Сергиевское', latitude: 53.842214, longitude: 51.163654 },
    { customer: 'ООО «Газпром трансгаз Самара»', name: 'Средневолжское' },
    { customer: 'ООО «Газпром трансгаз Самара»', name: 'Сызранское', latitude: 53.288236, longitude: 48.362061 },
    { customer: 'ООО «Газпром трансгаз Самара»', name: 'Тольяттинское', latitude: 53.614823, longitude: 49.785494 },
    { customer: 'ООО «Газпром трансгаз Самара»', name: 'Ульяновское', latitude: 54.312859, longitude: 48.298890 },
    
    // ООО «Газпром трансгаз Санкт-Петербург»
    { customer: 'ООО «Газпром трансгаз Санкт-Петербург»', name: 'Валдайское', latitude: 57.952214, longitude: 33.280237 },
    { customer: 'ООО «Газпром трансгаз Санкт-Петербург»', name: 'Волховское', latitude: 59.779867, longitude: 32.392245 },
    { customer: 'ООО «Газпром трансгаз Санкт-Петербург»', name: 'Калининградское', latitude: 54.730716, longitude: 20.567828 },
    { customer: 'ООО «Газпром трансгаз Санкт-Петербург»', name: 'Колпинское', latitude: 59.708317, longitude: 30.633020 },
    { customer: 'ООО «Газпром трансгаз Санкт-Петербург»', name: 'Новгородское', latitude: 58.580734, longitude: 31.280837 },
    { customer: 'ООО «Газпром трансгаз Санкт-Петербург»', name: 'Пикалевское', latitude: 59.491558, longitude: 34.338846 },
    { customer: 'ООО «Газпром трансгаз Санкт-Петербург»', name: 'Портовое', latitude: 60.680138, longitude: 28.817324 },
    { customer: 'ООО «Газпром трансгаз Санкт-Петербург»', name: 'Псковское', latitude: 57.844085, longitude: 28.388043 },
    { customer: 'ООО «Газпром трансгаз Санкт-Петербург»', name: 'Ржевское', latitude: 56.283492, longitude: 34.190500 },
    { customer: 'ООО «Газпром трансгаз Санкт-Петербург»', name: 'Северное', latitude: 60.127697, longitude: 30.335812 },
    { customer: 'ООО «Газпром трансгаз Санкт-Петербург»', name: 'Славянское', latitude: 59.375097, longitude: 28.622939 },
    { customer: 'ООО «Газпром трансгаз Санкт-Петербург»', name: 'Смоленское', latitude: 54.877825, longitude: 31.925936 },
    { customer: 'ООО «Газпром трансгаз Санкт-Петербург»', name: 'Торжокское', latitude: 57.027115, longitude: 35.018288 },
    { customer: 'ООО «Газпром трансгаз Санкт-Петербург»', name: 'Холм-Жирковское', latitude: 55.545798, longitude: 33.348420 },
    
    // ООО «Газпром трансгаз Саратов»
    { customer: 'ООО «Газпром трансгаз Саратов»', name: 'Александровогайское', latitude: 50.142955, longitude: 48.633748 },
    { customer: 'ООО «Газпром трансгаз Саратов»', name: 'Балашовское', latitude: 51.443559, longitude: 43.141581 },
    { customer: 'ООО «Газпром трансгаз Саратов»', name: 'Башмаковское', latitude: 53.234516, longitude: 43.022992 },
    { customer: 'ООО «Газпром трансгаз Саратов»', name: 'Екатериновское', latitude: 51.958257, longitude: 44.325472 },
    { customer: 'ООО «Газпром трансгаз Саратов»', name: 'Кирсановское', latitude: 52.682705, longitude: 42.761803 },
    { customer: 'ООО «Газпром трансгаз Саратов»', name: 'Мещерское', latitude: 52.706301, longitude: 44.145718 },
    { customer: 'ООО «Газпром трансгаз Саратов»', name: 'Мокроусское', latitude: 51.243771, longitude: 47.558737 },
    { customer: 'ООО «Газпром трансгаз Саратов»', name: 'Петровское', latitude: 52.271925, longitude: 45.406479 },
    { customer: 'ООО «Газпром трансгаз Саратов»', name: 'Приволжское', latitude: 51.844380, longitude: 46.433243 },
    { customer: 'ООО «Газпром трансгаз Саратов»', name: 'Пугачевское', latitude: 51.803224, longitude: 48.544752 },
    { customer: 'ООО «Газпром трансгаз Саратов»', name: 'Сторожевское', latitude: 51.660303, longitude: 45.914921 },
    
    // ООО «Газпром трансгаз Ставрополь»
    { customer: 'ООО «Газпром трансгаз Ставрополь»', name: 'Астраханское', latitude: 46.307934, longitude: 47.943551 },
    { customer: 'ООО «Газпром трансгаз Ставрополь»', name: 'Георгиевское', latitude: 44.101267, longitude: 43.449242 },
    { customer: 'ООО «Газпром трансгаз Ставрополь»', name: 'Зензелинское', latitude: 45.946250, longitude: 47.034160 },
    { customer: 'ООО «Газпром трансгаз Ставрополь»', name: 'Изобильненское', latitude: 45.365899, longitude: 41.736853 },
    { customer: 'ООО «Газпром трансгаз Ставрополь»', name: 'Камыш-Бурунское', latitude: 44.710941, longitude: 44.988283 },
    { customer: 'ООО «Газпром трансгаз Ставрополь»', name: 'Моздокское', latitude: 43.733577, longitude: 44.595800 },
    { customer: 'ООО «Газпром трансгаз Ставрополь»', name: 'Невинномысское', latitude: 44.656113, longitude: 41.971693 },
    { customer: 'ООО «Газпром трансгаз Ставрополь»', name: 'Привольненское', latitude: 45.904440, longitude: 41.295984 },
    { customer: 'ООО «Газпром трансгаз Ставрополь»', name: 'Светлоградское', latitude: 45.329378, longitude: 42.853077 },
    { customer: 'ООО «Газпром трансгаз Ставрополь»', name: 'Ставропольское', latitude: 45.264268, longitude: 41.853374 },
    
    // ООО «Газпром трансгаз Сургут»
    { customer: 'ООО «Газпром трансгаз Сургут»', name: 'Богандинское', latitude: 56.858243, longitude: 65.918045 },
    { customer: 'ООО «Газпром трансгаз Сургут»', name: 'Вынгапуровское', latitude: 63.192648, longitude: 75.552255 },
    { customer: 'ООО «Газпром трансгаз Сургут»', name: 'Губкинское', latitude: 63.864688, longitude: 76.566149 },
    { customer: 'ООО «Газпром трансгаз Сургут»', name: 'Демьянское', latitude: 59.504330, longitude: 69.999396 },
    { customer: 'ООО «Газпром трансгаз Сургут»', name: 'Ишимское', latitude: 56.318084, longitude: 69.006243 },
    { customer: 'ООО «Газпром трансгаз Сургут»', name: 'Ново-Уренгойское', latitude: 66.073562, longitude: 76.809402 },
    { customer: 'ООО «Газпром трансгаз Сургут»', name: 'Ортьягунское', latitude: 62.385998, longitude: 74.809132 },
    { customer: 'ООО «Газпром трансгаз Сургут»', name: 'Пурпейское', latitude: 64.476252, longitude: 76.693631 },
    { customer: 'ООО «Газпром трансгаз Сургут»', name: 'Самсоновское', latitude: 59.945506, longitude: 71.308302 },
    { customer: 'ООО «Газпром трансгаз Сургут»', name: 'Сургутское', latitude: 61.276114, longitude: 73.441347 },
    { customer: 'ООО «Газпром трансгаз Сургут»', name: 'Тобольское', latitude: 58.062365, longitude: 67.879094 },
    { customer: 'ООО «Газпром трансгаз Сургут»', name: 'Туртасское', latitude: 58.784393, longitude: 69.016997 },
    { customer: 'ООО «Газпром трансгаз Сургут»', name: 'Южно-Балыкское', latitude: 60.616989, longitude: 72.651146 },
    { customer: 'ООО «Газпром трансгаз Сургут»', name: 'Ярковское', latitude: 57.569426, longitude: 66.922185 },
    
    // ООО «Газпром трансгаз Томск»
    { customer: 'ООО «Газпром трансгаз Томск»', name: 'Алданское', latitude: 58.586047, longitude: 125.407338 },
    { customer: 'ООО «Газпром трансгаз Томск»', name: 'Александровское', latitude: 60.434694, longitude: 77.851953 },
    { customer: 'ООО «Газпром трансгаз Томск»', name: 'Алтайское', latitude: 53.324440, longitude: 83.604778 },
    { customer: 'ООО «Газпром трансгаз Томск»', name: 'Амурское', latitude: 50.525675, longitude: 136.984069 },
    { customer: 'ООО «Газпром трансгаз Томск»', name: 'Барабинское', latitude: 55.378507, longitude: 78.344392 },
    { customer: 'ООО «Газпром трансгаз Томск»', name: 'Иркутское', latitude: 52.281241, longitude: 104.301662 },
    { customer: 'ООО «Газпром трансгаз Томск»', name: 'Камчатское', latitude: 53.083154, longitude: 158.627127 },
    { customer: 'ООО «Газпром трансгаз Томск»', name: 'Кемеровское', latitude: 55.310884, longitude: 86.156955 },
    { customer: 'ООО «Газпром трансгаз Томск»', name: 'Ленское', latitude: 60.726992, longitude: 114.891051 },
    { customer: 'ООО «Газпром трансгаз Томск»', name: 'Магистральное', latitude: 56.174837, longitude: 107.462614 },
    { customer: 'ООО «Газпром трансгаз Томск»', name: 'Нерюнгринское', latitude: 56.662575, longitude: 124.741695 },
    { customer: 'ООО «Газпром трансгаз Томск»', name: 'Новокузнецкое', latitude: 53.840565, longitude: 87.110987 },
    { customer: 'ООО «Газпром трансгаз Томск»', name: 'Новосибирское', latitude: 54.989822, longitude: 83.053340 },
    { customer: 'ООО «Газпром трансгаз Томск»', name: 'Омское', latitude: 55.152712, longitude: 73.209084 },
    { customer: 'ООО «Газпром трансгаз Томск»', name: 'Приморское', latitude: 43.723847, longitude: 132.029400 },
    { customer: 'ООО «Газпром трансгаз Томск»', name: 'Свободненское', latitude: 51.386323, longitude: 128.113423 },
    { customer: 'ООО «Газпром трансгаз Томск»', name: 'Сковородинское', latitude: 53.972454, longitude: 123.930424 },
    { customer: 'ООО «Газпром трансгаз Томск»', name: 'Томское', latitude: 56.601707, longitude: 85.025605 },
    { customer: 'ООО «Газпром трансгаз Томск»', name: 'Хабаровское', latitude: 48.374413, longitude: 135.129621 },
    { customer: 'ООО «Газпром трансгаз Томск»', name: 'Юргинское', latitude: 55.792972, longitude: 84.644612 },
    
    // ООО «Газпром трансгаз Уфа»
    { customer: 'ООО «Газпром трансгаз Уфа»', name: 'Аркауловское', latitude: 55.450458, longitude: 57.911213 },
    { customer: 'ООО «Газпром трансгаз Уфа»', name: 'Дюртюлинское', latitude: 55.290075, longitude: 55.073042 },
    { customer: 'ООО «Газпром трансгаз Уфа»', name: 'Кармаскалинское', latitude: 54.451021, longitude: 56.152888 },
    { customer: 'ООО «Газпром трансгаз Уфа»', name: 'Полянское', latitude: 55.371453, longitude: 56.512120 },
    { customer: 'ООО «Газпром трансгаз Уфа»', name: 'Приютовское', latitude: 53.907269, longitude: 53.941269 },
    { customer: 'ООО «Газпром трансгаз Уфа»', name: 'Сибайское', latitude: 52.745468, longitude: 58.642207 },
    { customer: 'ООО «Газпром трансгаз Уфа»', name: 'Стерлитамакское', latitude: 53.755153, longitude: 55.957159 },
    { customer: 'ООО «Газпром трансгаз Уфа»', name: 'Ургалинское', latitude: 55.576246, longitude: 59.448709 },
    { customer: 'ООО «Газпром трансгаз Уфа»', name: 'Шаранское', latitude: 54.725625, longitude: 53.870697 },
    
    // ООО «Газпром трансгаз Ухта»
    { customer: 'ООО «Газпром трансгаз Ухта»', name: 'Воркутинское', latitude: 67.226238, longitude: 63.713135 },
    { customer: 'ООО «Газпром трансгаз Ухта»', name: 'Вуктыльское', latitude: 63.684675, longitude: 57.354453 },
    { customer: 'ООО «Газпром трансгаз Ухта»', name: 'Грязовецкое', latitude: 58.785796, longitude: 40.251873 },
    { customer: 'ООО «Газпром трансгаз Ухта»', name: 'Микуньское', latitude: 62.334929, longitude: 50.102686 },
    { customer: 'ООО «Газпром трансгаз Ухта»', name: 'Мышкинское', latitude: 57.827255, longitude: 38.435079 },
    { customer: 'ООО «Газпром трансгаз Ухта»', name: 'Нюксенское', latitude: 60.445842, longitude: 44.263673 },
    { customer: 'ООО «Газпром трансгаз Ухта»', name: 'Переславское', latitude: 56.690528, longitude: 38.844181 },
    { customer: 'ООО «Газпром трансгаз Ухта»', name: 'Печорское', latitude: 65.138143, longitude: 57.192286 },
    { customer: 'ООО «Газпром трансгаз Ухта»', name: 'Приводинское', latitude: 61.090252, longitude: 46.473388 },
    { customer: 'ООО «Газпром трансгаз Ухта»', name: 'Синдорское', latitude: 62.833431, longitude: 51.935006 },
    { customer: 'ООО «Газпром трансгаз Ухта»', name: 'Сосногорское', latitude: 63.658302, longitude: 53.772390 },
    { customer: 'ООО «Газпром трансгаз Ухта»', name: 'Урдомское', latitude: 61.740478, longitude: 48.478152 },
    { customer: 'ООО «Газпром трансгаз Ухта»', name: 'Шекснинское', latitude: 59.145632, longitude: 38.524444 },
    { customer: 'ООО «Газпром трансгаз Ухта»', name: 'Юбилейное', latitude: 59.677887, longitude: 42.030257 },
    
    // ООО «Газпром трансгаз Чайковский»
    { customer: 'ООО «Газпром трансгаз Чайковский»', name: 'Алмазное', latitude: 56.471340, longitude: 57.199081 },
    { customer: 'ООО «Газпром трансгаз Чайковский»', name: 'Бардымское', latitude: 56.876954, longitude: 56.026110 },
    { customer: 'ООО «Газпром трансгаз Чайковский»', name: 'Березниковское', latitude: 58.919039, longitude: 57.574175 },
    { customer: 'ООО «Газпром трансгаз Чайковский»', name: 'Воткинское', latitude: 57.062092, longitude: 53.994866 },
    { customer: 'ООО «Газпром трансгаз Чайковский»', name: 'Горнозаводское', latitude: 58.357744, longitude: 58.434947 },
    { customer: 'ООО «Газпром трансгаз Чайковский»', name: 'Гремячинское', latitude: 58.461086, longitude: 57.824999 },
    { customer: 'ООО «Газпром трансгаз Чайковский»', name: 'Кунгурское', latitude: 57.518428, longitude: 57.446110 },
    { customer: 'ООО «Газпром трансгаз Чайковский»', name: 'Можгинское', latitude: 56.494359, longitude: 52.231164 },
    { customer: 'ООО «Газпром трансгаз Чайковский»', name: 'Очёрское', latitude: 57.908537, longitude: 54.743568 },
    { customer: 'ООО «Газпром трансгаз Чайковский»', name: 'Пермское', latitude: 58.009273, longitude: 56.244422 },
    { customer: 'ООО «Газпром трансгаз Чайковский»', name: 'Увинское', latitude: 56.981494, longitude: 52.181464 },
    { customer: 'ООО «Газпром трансгаз Чайковский»', name: 'Чайковское', latitude: 56.778470, longitude: 54.140170 },
    
    // ООО «Газпром трансгаз Югорск»
    { customer: 'ООО «Газпром трансгаз Югорск»', name: 'Бобровское', latitude: 63.245226, longitude: 66.941013 },
    { customer: 'ООО «Газпром трансгаз Югорск»', name: 'Верхнеказымское', latitude: 63.813136, longitude: 67.833161 },
    { customer: 'ООО «Газпром трансгаз Югорск»', name: 'Ивдельское', latitude: 60.629910, longitude: 60.350118 },
    { customer: 'ООО «Газпром трансгаз Югорск»', name: 'Казымское', latitude: 63.686252, longitude: 66.725409 },
    { customer: 'ООО «Газпром трансгаз Югорск»', name: 'Карпинское', latitude: 59.869822, longitude: 59.820116 },
    { customer: 'ООО «Газпром трансгаз Югорск»', name: 'Комсомольское', latitude: 61.33758, longitude: 63.29781 },
    { customer: 'ООО «Газпром трансгаз Югорск»', name: 'Краснотурьинское', latitude: 59.782481, longitude: 60.376791 },
    { customer: 'ООО «Газпром трансгаз Югорск»', name: 'Лонг-Юганское', latitude: 64.786514, longitude: 70.941796 },
    { customer: 'ООО «Газпром трансгаз Югорск»', name: 'Надымское', latitude: 65.542896, longitude: 72.558100 },
    { customer: 'ООО «Газпром трансгаз Югорск»', name: 'Нижнетуринское', latitude: 58.633897, longitude: 59.954020 },
    { customer: 'ООО «Газпром трансгаз Югорск»', name: 'Ныдинское', latitude: 66.459919, longitude: 73.828019 },
    { customer: 'ООО «Газпром трансгаз Югорск»', name: 'Октябрьское', latitude: 62.557441, longitude: 65.955448 },
    { customer: 'ООО «Газпром трансгаз Югорск»', name: 'Пангодинское', latitude: 65.95920, longitude: 74.68101 },
    { customer: 'ООО «Газпром трансгаз Югорск»', name: 'Пелымское', latitude: 61.056643, longitude: 61.994889 },
    { customer: 'ООО «Газпром трансгаз Югорск»', name: 'Перегребненское', latitude: 62.96979, longitude: 65.14785 },
    { customer: 'ООО «Газпром трансгаз Югорск»', name: 'Правохеттинское', latitude: 65.42384, longitude: 73.46940 },
    { customer: 'ООО «Газпром трансгаз Югорск»', name: 'Приозерное', latitude: 64.299780, longitude: 71.091017 },
    { customer: 'ООО «Газпром трансгаз Югорск»', name: 'Пунгинское', latitude: 62.763981, longitude: 64.277726 },
    { customer: 'ООО «Газпром трансгаз Югорск»', name: 'Сорумское', latitude: 64.224801, longitude: 69.047223 },
    { customer: 'ООО «Газпром трансгаз Югорск»', name: 'Сосновское', latitude: 64.033275, longitude: 69.545071 },
    { customer: 'ООО «Газпром трансгаз Югорск»', name: 'Сосьвинское', latitude: 62.892465, longitude: 61.628538 },
    { customer: 'ООО «Газпром трансгаз Югорск»', name: 'Таежное', latitude: 61.949697, longitude: 64.825685 },
    { customer: 'ООО «Газпром трансгаз Югорск»', name: 'Уральское', latitude: 63.214951, longitude: 59.766750 },
    { customer: 'ООО «Газпром трансгаз Югорск»', name: 'Ягельное', latitude: 64.705349, longitude: 72.358026 },
    { customer: 'ООО «Газпром трансгаз Югорск»', name: 'Ямбургское ЛПУ', latitude: 65.857949, longitude: 74.490432 },
  ];

  for (const lpu of lpus) {
    const { latitude, longitude, ...rest } = lpu;
    const data: any = { ...rest };
    if (typeof latitude === 'number') data.latitude = latitude;
    if (typeof longitude === 'number') data.longitude = longitude;
    await prisma.lpu.create({ data });
  }
}

main().catch(e => {
  console.error(e);
  process.exit(1);
}).finally(() => prisma.$disconnect());

// NB: customer_name уникальный составной индекс нужно добавить в модель Lpu для upsert! 